In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

In [2]:
car_df = pd.read_csv("quikr_car.csv")

In [3]:
car_df.sample(9)

,name,company,year,Price,kms_driven,fuel_type
461,Ford Figo Petrol LXI,Ford,2011,"1,75,000","75,000 kms",Petrol
46,Honda City,Honda,2015,"4,99,999","55,000 kms",Petrol
126,Nissan Micra XV,Nissan,2011,"1,79,000","41,000 kms",Petrol
519,Maruti Suzuki Wagon R VXI BS IV,Maruti,2017,"3,75,000","23,000 kms",Petrol
492,Hyundai Verna 1.6 CRDI E,Hyundai,2016,"1,95,000","56,000 kms",Diesel
439,Volkswagen Vento Highline Plus 1.5 Diesel AT,Volkswagen,2015,"5,50,000","34,000 kms",Diesel
81,Mahindra Scorpio VLX 2WD BS IV,Mahindra,2014,"6,99,000","50,000 kms",Diesel
253,Hyundai Eon Sportz,Hyundai,2012,"1,78,000","30,000 kms",Petrol
875,Honda City VX Petrol,Honda,2016,"8,60,000","95,000 kms",Petrol

In [4]:
car_df.shape

(892, 6)

In [5]:
car_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 892 entries, 0 to 891
Data columns (total 6 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   name        892 non-null    object
 1   company     892 non-null    object
 2   year        892 non-null    object
 3   Price       892 non-null    object
 4   kms_driven  840 non-null    object
 5   fuel_type   837 non-null    object
dtypes: object(6)
memory usage: 41.9+ KB

#### Creating a Backup Copy

In [6]:
backup_df = car_df.copy()

.

# üßπ Data Quality Report

## üîç Issues Identified

### 1. **Inconsistent Model and Brand Names**
- Car names are inconsistent across the dataset.
- The model names are sometimes concatenated with brand names, leading to duplication and confusion.

### 2. **Company Column Issues**
- The `company` column contains:
  - Numbers (e.g., `9`)
  - Years instead of company names
  - Single-letter entries (e.g., `r`, `t`)
  - Irrelevant values mixed with valid names

### 3. **Year Column Issues**
- The `year` column:
  - Is in `object` data type; needs to be converted to `datetime` or `int` format.
  - Contains non-year values such as `cab`, `t xe`, `EV2`, `r...`, `zest`, etc.

### 4. **Price Column Issues**
- The `Price` column:
  - Is in `object` format; should be converted to `int` after cleaning.
  - Contains non-numeric values like `"Ask For Price"` which should be handled appropriately.

### 5. **Kms Driven Column Issues**
- The `kms_driven` column:
  - Contains irrelevant values such as `"Petrol"`.
  - Has `NaN` (missing) entries.
  - Needs to be cleaned and converted to numeric format.

### 6. **Fuel Type Column Issues**
- The `fuel_type` column contains:
  - Missing values (`NaN`) that should be imputed or handled based on context.

---

## ‚úÖ Recommended Actions

- Standardize brand and model names using string processing techniques.
- Filter out or correct invalid entries in `company`, `year`, `price`, and `kms_driven` columns.
- Convert appropriate columns to correct data types.
- Handle missing and irrelevant values systematically using techniques like imputation, filtering, or replacing.

---

Let me know if you want a Python code snippet to clean this data as well!

In [7]:
car_df["name"]

0        Hyundai Santro Xing XO eRLX Euro III
1                     Mahindra Jeep CL550 MDI
2                  Maruti Suzuki Alto 800 Vxi
3      Hyundai Grand i10 Magna 1.2 Kappa VTVT
4            Ford EcoSport Titanium 1.5L TDCi
                        ...
887                                        Ta
888                       Tata Zest XM Diesel
889                        Mahindra Quanto C8
890                  Honda Amaze 1.2 E i VTEC
891                 Chevrolet Sail 1.2 LT ABS
Name: name, Length: 892, dtype: object

In [8]:
car_df["company"].value_counts()

company
Maruti        235
Hyundai       145
Mahindra      100
Tata           74
Honda          61
Toyota         39
Chevrolet      35
Renault        34
Ford           31
Volkswagen     20
Skoda          13
Audi           11
Mini            8
Datsun          8
BMW             8
Mitsubishi      6
Mercedes        6
Nissan          6
Commercial      6
Force           4
Fiat            4
I               3
Hindustan       3
tata            3
Jaguar          2
Used            2
Sale            2
MARUTI          2
urgent          2
URJENT          1
Land            1
Yamaha          1
Jeep            1
Swift           1
selling         1
very            1
i               1
2012            1
Well            1
Volvo           1
all             1
7               1
9               1
scratch         1
sell            1
TATA            1
Any             1
Tara            1
Name: count, dtype: int64

In [9]:
car_df["year"].value_counts()

year
2015    117
2014     94
2013     94
2016     76
2012     75
       ...
cab       1
t xe      1
EV2       1
r...      1
zest      1
Name: count, Length: 61, dtype: int64

In [10]:
car_df["Price"].value_counts()

Price
Ask For Price    35
2,50,000         17
3,50,000         14
1,80,000         13
1,30,000         12
                 ..
12,25,000         1
68,000            1
9,70,000          1
8,60,000          1
5,00,001          1
Name: count, Length: 274, dtype: int64

In [11]:
car_df["kms_driven"].min

<bound method Series.min of 0      45,000 kms
1          40 kms
2      22,000 kms
3      28,000 kms
4      36,000 kms
          ...
887           NaN
888    27,000 kms
889    40,000 kms
890        Petrol
891        Petrol
Name: kms_driven, Length: 892, dtype: object>

In [12]:
car_df["fuel_type"].value_counts()

fuel_type
Petrol    440
Diesel    395
LPG         2
Name: count, dtype: int64

In [13]:
car_df.columns

Index(['name', 'company', 'year', 'Price', 'kms_driven', 'fuel_type'], dtype='object')

### Cleaning Data

##### changing Year column into "int" data type and also removing non numerical values

In [14]:
car_df= car_df[car_df["year"].str.isnumeric()]

In [15]:
car_df["year"] = car_df["year"].astype(int)

In [16]:
car_df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 842 entries, 0 to 891
Data columns (total 6 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   name        842 non-null    object
 1   company     842 non-null    object
 2   year        842 non-null    int64
 3   Price       842 non-null    object
 4   kms_driven  840 non-null    object
 5   fuel_type   837 non-null    object
dtypes: int64(1), object(5)
memory usage: 46.0+ KB

#### changing Price  column into "int" data type and also doing transformation like removing ","

In [17]:
car_df = car_df[car_df["Price"] != 'Ask For Price'] # only taking values accept 'Ask For Price',

In [18]:
car_df["Price"].unique() # 'Ask For Price' now removed

array(['80,000', '4,25,000', '3,25,000', '5,75,000', '1,75,000',
       '1,90,000', '8,30,000', '2,50,000', '1,82,000', '3,15,000',
       '4,15,000', '3,20,000', '10,00,000', '5,00,000', '3,50,000',
       '1,60,000', '3,10,000', '75,000', '1,00,000', '2,90,000', '95,000',
       '1,80,000', '3,85,000', '1,05,000', '6,50,000', '6,89,999',
       '4,48,000', '5,49,000', '5,01,000', '4,89,999', '2,80,000',
       '3,49,999', '2,84,999', '3,45,000', '4,99,999', '2,35,000',
       '2,49,999', '14,75,000', '3,95,000', '2,20,000', '1,70,000',
       '85,000', '2,00,000', '5,70,000', '1,10,000', '4,48,999',
       '18,91,111', '1,59,500', '3,44,999', '4,49,999', '8,65,000',
       '6,99,000', '3,75,000', '2,24,999', '12,00,000', '1,95,000',
       '3,51,000', '2,40,000', '90,000', '1,55,000', '6,00,000',
       '1,89,500', '2,10,000', '3,90,000', '1,35,000', '16,00,000',
       '7,01,000', '2,65,000', '5,25,000', '3,72,000', '6,35,000',
       '5,50,000', '4,85,000', '3,29,500', '2,51,111', '5,69,999',
       '69,999', '2,99,999', '3,99,999', '4,50,000', '2,70,000',
       '1,58,400', '1,79,000', '1,25,000', '2,99,000', '1,50,000',
       '2,75,000', '2,85,000', '3,40,000', '70,000', '2,89,999',
       '8,49,999', '7,49,999', '2,74,999', '9,84,999', '5,99,999',
       '2,44,999', '4,74,999', '2,45,000', '1,69,500', '3,70,000',
       '1,68,000', '1,45,000', '98,500', '2,09,000', '1,85,000',
       '9,00,000', '6,99,999', '1,99,999', '5,44,999', '1,99,000',
       '5,40,000', '49,000', '7,00,000', '55,000', '8,95,000', '3,55,000',
       '5,65,000', '3,65,000', '40,000', '4,00,000', '3,30,000',
       '5,80,000', '3,79,000', '2,19,000', '5,19,000', '7,30,000',
       '20,00,000', '21,00,000', '14,00,000', '3,11,000', '8,55,000',
       '5,35,000', '1,78,000', '3,00,000', '2,55,000', '5,49,999',
       '3,80,000', '57,000', '4,10,000', '2,25,000', '1,20,000', '59,000',
       '5,99,000', '6,75,000', '72,500', '6,10,000', '2,30,000',
       '5,20,000', '5,24,999', '4,24,999', '6,44,999', '5,84,999',
       '7,99,999', '4,44,999', '6,49,999', '9,44,999', '5,74,999',
       '3,74,999', '1,30,000', '4,01,000', '13,50,000', '1,74,999',
       '2,39,999', '99,999', '3,24,999', '10,74,999', '11,30,000',
       '1,49,000', '7,70,000', '30,000', '3,35,000', '3,99,000', '65,000',
       '1,69,999', '1,65,000', '5,60,000', '9,50,000', '7,15,000',
       '45,000', '9,40,000', '1,55,555', '15,00,000', '4,95,000',
       '8,00,000', '12,99,000', '5,30,000', '14,99,000', '32,000',
       '4,05,000', '7,60,000', '7,50,000', '4,19,000', '1,40,000',
       '15,40,000', '1,23,000', '4,98,000', '4,80,000', '4,88,000',
       '15,25,000', '5,48,900', '7,25,000', '99,000', '52,000',
       '28,00,000', '4,99,000', '3,81,000', '2,78,000', '6,90,000',
       '2,60,000', '90,001', '1,15,000', '15,99,000', '1,59,000',
       '51,999', '2,15,000', '35,000', '11,50,000', '2,69,000', '60,000',
       '4,30,000', '85,00,003', '4,01,919', '4,90,000', '4,24,000',
       '2,05,000', '5,49,900', '4,35,000', '1,89,700', '3,89,700',
       '3,60,000', '2,95,000', '1,14,990', '10,65,000', '4,70,000',
       '48,000', '1,88,000', '4,65,000', '1,79,999', '21,90,000',
       '23,90,000', '10,75,000', '4,75,000', '10,25,000', '6,15,000',
       '19,00,000', '14,90,000', '15,10,000', '18,50,000', '7,90,000',
       '17,25,000', '12,25,000', '68,000', '9,70,000', '31,00,000',
       '8,99,000', '88,000', '53,000', '5,68,500', '71,000', '5,90,000',
       '7,95,000', '42,000', '1,89,000', '1,62,000', '35,999',
       '29,00,000', '39,999', '50,500', '5,10,000', '8,60,000',
       '5,00,001'], dtype=object)

In [19]:
car_df["Price"] = car_df["Price"].str.replace("," , "").astype(int)

In [20]:
car_df["Price"]

0       80000
1      425000
3      325000
4      575000
6      175000
        ...
886    300000
888    260000
889    390000
890    180000
891    160000
Name: Price, Length: 819, dtype: int64

In [21]:
car_df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 819 entries, 0 to 891
Data columns (total 6 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   name        819 non-null    object
 1   company     819 non-null    object
 2   year        819 non-null    int64
 3   Price       819 non-null    int64
 4   kms_driven  819 non-null    object
 5   fuel_type   816 non-null    object
dtypes: int64(2), object(4)
memory usage: 44.8+ KB

#### kms_driven has object values with kms at last.

In [22]:
car_df["kms_driven"] = car_df["kms_driven"].str.split().str.get(0).str.replace(",","")

In [23]:
car_df["kms_driven"]

0       45000
1          40
3       28000
4       36000
6       41000
        ...
886    132000
888     27000
889     40000
890    Petrol
891    Petrol
Name: kms_driven, Length: 819, dtype: object

##### It has nan values and two rows have 'Petrol' in them

In [25]:
car_df = car_df[car_df["kms_driven"].str.isnumeric()]

In [27]:
car_df["kms_driven"] =  car_df["kms_driven"].astype(int)

In [28]:
car_df.sample(9)

,name,company,year,Price,kms_driven,fuel_type
734,Toyota Fortuner 3.0 4x4 MT,Toyota,2013,1499000,97000,Diesel
415,Maruti Suzuki Alto K10 VXi,Maruti,2014,270000,22000,Petrol
45,Honda Amaze 1.5 SX i DTEC,Honda,2015,345000,36000,Diesel
813,Tata Nano,Tata,2013,60000,7000,Petrol
640,Maruti Suzuki Swift VDi BS IV,Maruti,2012,280000,48006,Diesel
220,Mahindra Jeep CL550 MDI,Mahindra,2019,379000,0,Diesel
72,Honda City,Honda,2015,448999,54000,Petrol
115,Maruti Suzuki Ertiga ZXi,Maruti,2014,569999,45000,Petrol
480,Tata Sumo Gold LX BS IV,Tata,2014,250000,99000,Diesel

In [29]:
car_df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 817 entries, 0 to 889
Data columns (total 6 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   name        817 non-null    object
 1   company     817 non-null    object
 2   year        817 non-null    int64
 3   Price       817 non-null    int64
 4   kms_driven  817 non-null    int64
 5   fuel_type   816 non-null    object
dtypes: int64(3), object(3)
memory usage: 44.7+ KB

##### fuel_type has nan values

In [32]:
car_df=car_df[~car_df['fuel_type'].isna()]

##### Company does not need any cleaning now. Changing car names. Keeping only the first three words

In [33]:
car_df["name"] =  car_df["name"].str.split().str.slice(start = 0 , stop = 3).str.join(" ")

C:\Users\sajan\AppData\Local\Temp\ipykernel_7680\588565070.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  car_df["name"] =  car_df["name"].str.split().str.slice(start = 0 , stop = 3).str.join(" ")

In [34]:
car_df

                       name   company  year   Price  kms_driven fuel_type
0       Hyundai Santro Xing   Hyundai  2007   80000       45000    Petrol
1       Mahindra Jeep CL550  Mahindra  2006  425000          40    Diesel
3         Hyundai Grand i10   Hyundai  2014  325000       28000    Petrol
4    Ford EcoSport Titanium      Ford  2014  575000       36000    Diesel
6                 Ford Figo      Ford  2012  175000       41000    Diesel
..                      ...       ...   ...     ...         ...       ...
883      Maruti Suzuki Ritz    Maruti  2011  270000       50000    Petrol
885          Tata Indica V2      Tata  2009  110000       30000    Diesel
886    Toyota Corolla Altis    Toyota  2009  300000      132000    Petrol
888            Tata Zest XM      Tata  2018  260000       27000    Diesel
889      Mahindra Quanto C8  Mahindra  2013  390000       40000    Diesel

[816 rows x 6 columns]

In [36]:
##### Resetting the index of the final cleaned data

In [35]:
car_df = car_df.reset_index( drop = True)

In [38]:
car_df.to_csv('cleaned_car_data.csv', index=False)

### Cleaned Data

In [40]:
car_df.sample(10)

                     name    company  year    Price  kms_driven fuel_type
404    Chevrolet Spark LS  Chevrolet  2010    95000       23000    Petrol
424           Audi Q3 2.0       Audi  2013  1499000       37000    Diesel
543   Renault Duster 85PS    Renault  2013   401919       57923    Diesel
692      Hyundai Getz GLE    Hyundai  2007    99000       55000    Petrol
490     Hyundai Grand i10    Hyundai  2017   400000       20000    Petrol
463  Maruti Suzuki Ertiga     Maruti  2015   550000       75000    Petrol
744     Chevrolet Beat LS  Chevrolet  2014   189000       31000    Diesel
106     Hyundai Grand i10    Hyundai  2014   345000       49000    Diesel
479     Maruti Suzuki Zen     Maruti  2003    99999       53000    Petrol
260         Mini Cooper S       Mini  2013  1891111       13500    Petrol